# PartGuid Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..PartGuid Property
FabricationPart Class See Also
---
The fabrication part's globally unique identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public Guid PartGuid { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PartGuid As Guid
	Get
```

Visual C++
---
```text
public:
property Guid PartGuid {
	Guid get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace